 # Paso 4. Análisis exploratorio de datos (Python)

Además de los datos que recuperaste en las tareas anteriores te han dado un segundo archivo. Ahora tienes estos dos CSV:

/datasets/project_sql_result_01.csv. contiene los siguientes datos:

company_name: nombre de la empresa de taxis

trips_amount: el número de viajes de cada compañía de taxis el 15 y 16 de noviembre de 2017. 

/datasets/project_sql_result_04.csv. contiene los siguientes datos:

dropoff_location_name: barrios de Chicago donde finalizaron los viajes

average_trips: el promedio de viajes que terminaron en cada barrio en noviembre de 2017.

 Para estos dos datasets ahora necesitas

importar los archivos
estudiar los datos que contienen
asegurarte de que los tipos de datos sean correctos
identificar los 10 principales barrios en términos de finalización del recorrido
hacer gráficos: empresas de taxis y número de viajes, los 10 barrios principales por número de finalizaciones
sacar conclusiones basadas en cada gráfico y explicar los resultados\

# Paso 5. Prueba de hipótesis (Python)

/datasets/project_sql_result_07.csv — el resultado de la última consulta. Contiene datos sobre viajes desde el Loop hasta el Aeropuerto Internacional O'Hare. Recuerda, estos son los valores de campo de la tabla:

start_ts: fecha y hora de la recogida
weather_conditions: condiciones climáticas en el momento en el que comenzó el viaje
duration_seconds: duración del viaje en segundos
Prueba la hipótesis:

"La duración promedio de los viajes desde el Loop hasta el Aeropuerto Internacional O'Hare cambia los sábados lluviosos".

Decide por tu cuenta dónde establecer el nivel de significación (alfa).

## Explica:

cómo planteaste las hipótesis nula y alternativa
qué criterio usaste para probar las hipótesis y por qué
¿Cómo será evaluado mi proyecto?
Estos son los criterios de evaluación del proyecto. Léelos atentamente antes de empezar a trabajar.

Esto es lo que buscará el revisor del proyecto al evaluar tu proyecto:

cómo recuperas los datos del sitio web
cómo creas slices de datos
cómo agrupas los datos
si usas correctamente los diversos métodos para combinar datos
cómo formulas las hipótesis
qué criterios utilizas para probar las hipótesis y por qué
a qué conclusiones llegas
si dejas comentarios en cada paso
Las fichas de ayuda y resúmenes de las lecciones anteriores tienen todo lo que necesitas para completar el proyecto.

In [1]:
import pandas as pd
import seaborn as sns 
import matplotlib.pyplot as plt
import math
import numpy as np
from scipy import stats as st
from IPython.display import display
from scipy.stats import ttest_ind

In [2]:
df_companhias_numerosdeviajes = pd.read_csv('Data Frames/moved_project_sql_result_01.csv')
display(df_companhias_numerosdeviajes)

                                 company_name  trips_amount
0                                   Flash Cab         19558
1                   Taxi Affiliation Services         11422
2                            Medallion Leasin         10367
3                                  Yellow Cab          9888
4             Taxi Affiliation Service Yellow          9299
..                                        ...           ...
59               4053 - 40193 Adwar H. Nikola             7
60                    2733 - 74600 Benny Jona             7
61              5874 - 73628 Sergey Cab Corp.             5
62  2241 - 44667 - Felman Corp, Manuel Alonso             3
63                3556 - 36214 RC Andrews Cab             2

[64 rows x 2 columns]

En esta parte del analisis podemos notar que nuestras columnas estan en el formato correcto para la manipulacion.

Con respecto a los valores nulos podemos notar

In [3]:
display(df_companhias_numerosdeviajes.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   company_name  64 non-null     object
 1   trips_amount  64 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.1+ KB

None

In [4]:
# Aqui estamos sacando el porsentaje de valores NAN en cada columna
100*df_companhias_numerosdeviajes.isna().sum()/df_companhias_numerosdeviajes.shape[0]

company_name    0.0
trips_amount    0.0
dtype: float64

Con el codigo de arriva nos dice que tenemos 0 porcentaje de valores null en las dos columnas.

In [5]:
df_barriosChicago_promediodeviajes = pd.read_csv('Data Frames/moved_project_sql_result_04.csv')
display(df_barriosChicago_promediodeviajes)

   dropoff_location_name  average_trips
0                   Loop   10727.466667
1            River North    9523.666667
2          Streeterville    6664.666667
3              West Loop    5163.666667
4                 O'Hare    2546.900000
..                   ...            ...
89       Mount Greenwood       3.137931
90             Hegewisch       3.117647
91              Burnside       2.333333
92             East Side       1.961538
93             Riverdale       1.800000

[94 rows x 2 columns]

In [6]:
display(df_barriosChicago_promediodeviajes.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 94 entries, 0 to 93
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   dropoff_location_name  94 non-null     object
 1   average_trips          94 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.6+ KB

None

En esta parte del analisis podemos notar que nuestras columnas estan en el formato correcto para la manipulacion.

Con respecto a los valores nulos podemos notar

In [7]:
# Aqui estamos sacando el porsentaje de valores NAN en cada columna
100*df_barriosChicago_promediodeviajes.isna().sum()/df_barriosChicago_promediodeviajes.shape[0]

dropoff_location_name    0.0
average_trips            0.0
dtype: float64

Con el codigo de arriva nos dice que tenemos 0 porcentaje de valores null en las dos columnas.